# IsDefaultZone Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Zone..::..IsDefaultZone Property
Zone Class See Also
---
Reports whether this zone is default or not.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsDefaultZone { get; set; }
```

Visual Basic
---
```text
Public Property IsDefaultZone As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsDefaultZone {
	bool get ();
	void set (bool value);
}
```

# Remarks
This property can be used to set the current zone as the default zone.
# See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace